In [1]:
import pandas as pd

In [2]:
data =[(1,2,3,4),
       (5,6,7,8),
       (9,10,11,12),
       (13,14,15,16)]
df = pd.DataFrame(data, 'L1 L2 L3 L4'.split(), 'C1 C2 C3 C4'.split())

In [3]:
df

    C1  C2  C3  C4
L1   1   2   3   4
L2   5   6   7   8
L3   9  10  11  12
L4  13  14  15  16

In [4]:
df['C1']

L1     1
L2     5
L3     9
L4    13
Name: C1, dtype: int64

In [5]:
type(df['C1'])

pandas.core.series.Series

In [6]:
df[['C3', 'C1']]

    C3  C1
L1   3   1
L2   7   5
L3  11   9
L4  15  13

In [7]:
df[:]

    C1  C2  C3  C4
L1   1   2   3   4
L2   5   6   7   8
L3   9  10  11  12
L4  13  14  15  16

In [8]:
df[1:]

    C1  C2  C3  C4
L2   5   6   7   8
L3   9  10  11  12
L4  13  14  15  16

In [9]:
df.loc[['L3', 'L2']]

    C1  C2  C3  C4
L3   9  10  11  12
L2   5   6   7   8

In [10]:
df.loc['L1', 'C2']

2

In [12]:
df.iloc[0, 1]

2

In [15]:
df.loc[['L3', 'L1'], ['C4', 'C1']]

    C4  C1
L3  12   9
L1   4   1

In [16]:
df.iloc[[2, 0], [3, 0]]

    C4  C1
L3  12   9
L1   4   1